#### Terraform Format and Style 🖌 `success` (ignored)
#### Terraform Initialization ⚙️ `success`
#### Terraform Validation 🤖 Success! The configuration is valid.


#### Terraform Plan 📖 `success`

<details><summary>Show Plan</summary>

```terraform
Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.github.module.victor_moreliere.github_membership.membership has been deleted
  - resource "github_membership" "membership" {
      - etag     = "W/\"410570709c65586ba76b820959825f93fbdbe868d0c913509fb97be58f1e9433\"" -> null
      - id       = "SiMDE-Projects:GalliusJulius" -> null
      - role     = "member" -> null
      - username = "GalliusJulius" -> null
    }
  # module.github.module.repositories.github_team_repository.simde_flairsou-api has been changed
  ~ resource "github_team_repository" "simde_flairsou-api" {
      ~ etag       = "W/\"90c57724b1d77be86b02cc61056d2c620423fa772025794fa33231ebb8b1c9d7\"" -> "W/\"2b73f024a6678232919e6d1b0864c97276759b9073eb03496771383d4bfc1b00\""
        id         = "4217733:flairsou-api"
        # (3 unchanged attributes hidden)
    }
  # module.github.module.repositories.github_team_repository.gesasso_gesasso_mkultra has been changed
  ~ resource "github_team_repository" "gesasso_gesasso_mkultra" {
      ~ etag       = "W/\"907a31cd6c52ee12d7487efdb315c0c97122bb7e8f8ea63e9b9f3703126d0239\"" -> "W/\"2a6727318b4120c56966afbe42cb04eb080e49e10509e53fab454030d5ce5f12\""
        id         = "4673796:gesasso_mkultra"
        # (3 unchanged attributes hidden)
    }
  # module.github.module.repositories.github_repository_project.gesasso_project has been changed
  ~ resource "github_repository_project" "gesasso_project" {
      ~ etag       = "W/\"1ba17ba99409664b6670790b0f0049ea9509ac9f37e336648af097e17c6dd891\"" -> "W/\"b33b294d988ed9776ff44dd791fdfa6dc307f7e30d764ef4a7ab9ad0ec07f438\""
        id         = "13581962"
        name       = "Gesasso project"
        # (3 unchanged attributes hidden)
    }
  # module.github.module.repositories.github_repository.gesasso_mkultra has been changed
  ~ resource "github_repository" "gesasso_mkultra" {
      ~ etag                   = "W/\"241446188205a9496795d27a85859e38550c06f7cdf7884e4ea9766433f338fb\"" -> "W/\"3cf9936dbc10390dd50c64fb70a99d044347e2a008a857862f8054f2bf5772e6\""
        id                     = "gesasso_mkultra"
        name                   = "gesasso_mkultra"
        # (25 unchanged attributes hidden)
    }
  # module.github.module.repositories.github_team_repository.simde_flairsou has been changed
  ~ resource "github_team_repository" "simde_flairsou" {
      ~ etag       = "W/\"39bb5ab01bdebfd94b8ef069125472e044eecaf1cb1e788a715c6cc571c4c2ca\"" -> "W/\"72e0548cf82543ac642d898305d44896e51c865a1532cdfb1bdfc90f556ddcbc\""
        id         = "4217733:flairsou"
        # (3 unchanged attributes hidden)
    }
  # module.github.module.repositories.github_team_repository.flairsou_flairsou has been changed
  ~ resource "github_team_repository" "flairsou_flairsou" {
      ~ etag       = "W/\"39bb5ab01bdebfd94b8ef069125472e044eecaf1cb1e788a715c6cc571c4c2ca\"" -> "W/\"72e0548cf82543ac642d898305d44896e51c865a1532cdfb1bdfc90f556ddcbc\""
        id         = "4276153:flairsou"
        # (3 unchanged attributes hidden)
    }
  # module.github.module.repositories.github_team_repository.simde_gesasso_mkmail has been changed
  ~ resource "github_team_repository" "simde_gesasso_mkmail" {
      ~ etag       = "W/\"9c7723fa1c13907a3e03f36a59b7ef63581870ef9d9943bb4f94e55eb70a85bc\"" -> "W/\"c3957b647b3193bf998de58ff936dd02ba0cd92a22cc20195d06362902b1642a\""
        id         = "4217733:gesasso_mkmail"
        # (3 unchanged attributes hidden)
    }
  # module.github.module.repositories.github_team_repository.gesasso_gesasso_mkmail has been changed
  ~ resource "github_team_repository" "gesasso_gesasso_mkmail" {
      ~ etag       = "W/\"9c7723fa1c13907a3e03f36a59b7ef63581870ef9d9943bb4f94e55eb70a85bc\"" -> "W/\"c3957b647b3193bf998de58ff936dd02ba0cd92a22cc20195d06362902b1642a\""
        id         = "4673796:gesasso_mkmail"
        # (3 unchanged attributes hidden)
    }
  # module.github.module.repositories.github_team_repository.simde_gesasso_mkultra has been changed
  ~ resource "github_team_repository" "simde_gesasso_mkultra" {
      ~ etag       = "W/\"907a31cd6c52ee12d7487efdb315c0c97122bb7e8f8ea63e9b9f3703126d0239\"" -> "W/\"2a6727318b4120c56966afbe42cb04eb080e49e10509e53fab454030d5ce5f12\""
        id         = "4217733:gesasso_mkultra"
        # (3 unchanged attributes hidden)
    }
  # module.github.module.repositories.github_team_repository.flairsou_flairsou-api has been changed
  ~ resource "github_team_repository" "flairsou_flairsou-api" {
      ~ etag       = "W/\"90c57724b1d77be86b02cc61056d2c620423fa772025794fa33231ebb8b1c9d7\"" -> "W/\"2b73f024a6678232919e6d1b0864c97276759b9073eb03496771383d4bfc1b00\""
        id         = "4276153:flairsou-api"
        # (3 unchanged attributes hidden)
    }
  # module.github.github_team_repository.payutc_woolly_api has been changed
  ~ resource "github_team_repository" "payutc_woolly_api" {
      ~ etag       = "W/\"badeca76d8d71d179f8cceca4d2ce1dffcee8a6f6de96a677b528b6b29fb97de\"" -> "W/\"de885666ffca25ebe6a13c006b7d1f1703b2db9ae887c270ddcd27d47567a0c1\""
        id         = "3158200:woolly-api"
        # (3 unchanged attributes hidden)
    }
  # module.github.github_team_repository.payutc_woolly_ui has been changed
  ~ resource "github_team_repository" "payutc_woolly_ui" {
      ~ etag       = "W/\"e5fa6705ae77e73e94e4b07eebe5612e9b3e808e4902b33b1888bf8b840642b3\"" -> "W/\"8cd3d7c5686d2f4153c79a47bfaabe425eb281f10920d13450ae5e9f3dbb3229\""
        id         = "3158200:woolly-ui"
        # (3 unchanged attributes hidden)
    }
  # module.github.github_team_repository.planner_planner has been changed
  ~ resource "github_team_repository" "planner_planner" {
      ~ etag       = "W/\"2648dbad2cb6e5187b76e5998da6e8c7984efb5b53df87d5534480ce56843cd5\"" -> "W/\"11483e7aeee1423a2c8afeaf1c9bca7d42186c1e94b154cf54cf6fd1742392a4\""
        id         = "3158217:planner"
        # (3 unchanged attributes hidden)
    }
  # module.github.github_team_repository.payutc_payback has been changed
  ~ resource "github_team_repository" "payutc_payback" {
      ~ etag       = "W/\"4e907ef8433d194614606d7afd07936295e513eca41d1c4b57f4e95c7ce3e652\"" -> "W/\"ec438f6390e162b36ad71917e9910ec949dbf13446d4e7d396a753013936c426\""
        id         = "3158200:payback"
        # (3 unchanged attributes hidden)
    }
  # module.github.github_team_repository.locky_locky has been changed
  ~ resource "github_team_repository" "locky_locky" {
      ~ etag       = "W/\"b71a2b8cb128cd5d4035daf6cb20e242cfc84bcbecca2aec0ad78f340a3ff6bf\"" -> "W/\"7e0f031c3c39bc03fae834b500a3347934fde074e6e9552725c1b3d33f828981\""
        id         = "3644328:locky"
        # (3 unchanged attributes hidden)
    }
  # module.github.github_team.application_utcbde has been changed
  ~ resource "github_team" "application_utcbde" {
      ~ etag          = "W/\"fc87351cafd6790e8312e9c63d6f8a1f16acae659c78dd3232a1a84c15b1a211\"" -> "W/\"d06c2f9a71bc1a89ebf8c9f9b0549bb4a4225edb3b025c8fbe503626da42d5b3\""
        id            = "3158184"
        name          = "Application UTC/BDE"
        # (5 unchanged attributes hidden)
    }
  # module.github.github_team_repository.payutc_jessy has been changed
  ~ resource "github_team_repository" "payutc_jessy" {
      ~ etag       = "W/\"81518a459891697543aedffd617d819defe05252ef2bd11e7e853e3f594c354f\"" -> "W/\"1e70557823dc870b6a730d5599f05833b52b7e0edea383a413805d311249ede3\""
        id         = "3158200:jessy"
        # (3 unchanged attributes hidden)
    }
  # module.github.github_team.covoit_utc has been changed
  ~ resource "github_team" "covoit_utc" {
      ~ etag          = "W/\"25c89b29dac02c198b621dce88c43351c827fca405bd601c82e7a295711e8041\"" -> "W/\"83c467c3ee6a626d80c3d62d969e59a7a6b366c54e5c8feeb4810b66cada9778\""
        id            = "3158193"
        name          = "Covoit'UTC"
        # (5 unchanged attributes hidden)
    }
  # module.github.github_team_repository.covoitutc_covoitutc has been changed
  ~ resource "github_team_repository" "covoitutc_covoitutc" {
      ~ etag       = "W/\"b279fd54f24fe6beffa8944a986c6b5e13524e71509b21f191ca78c197c2d0a4\"" -> "W/\"1e58e9d28ee4a3f1d148b6c091094744438364c7b3f540eb079e60e219ccfe43\""
        id         = "3158193:covoitutc"
        # (3 unchanged attributes hidden)
    }
  # module.github.github_team_repository.portail_portail has been changed
  ~ resource "github_team_repository" "portail_portail" {
      ~ etag       = "W/\"8f95f727486306be839041b28d1db3f7554b3620c9f218ca668c656ed2e279aa\"" -> "W/\"09243634a3c96f3c847a82a652e683ca3a99c8ce84325b5136b5d6406b530d62\""
        id         = "3158212:portail"
        # (3 unchanged attributes hidden)
    }
  # module.github.github_team_repository.woolly_woolly_ui has been changed
  ~ resource "github_team_repository" "woolly_woolly_ui" {
      ~ etag       = "W/\"e5fa6705ae77e73e94e4b07eebe5612e9b3e808e4902b33b1888bf8b840642b3\"" -> "W/\"8cd3d7c5686d2f4153c79a47bfaabe425eb281f10920d13450ae5e9f3dbb3229\""
        id         = "3158208:woolly-ui"
        # (3 unchanged attributes hidden)
    }
  # module.github.github_team_repository.jeffrey_jeffrey has been changed
  ~ resource "github_team_repository" "jeffrey_jeffrey" {
      ~ etag       = "W/\"4762a3a53ce344407899027334c714ed3859ed590c7888f0cc558b0c0309976c\"" -> "W/\"e91f315750f15bddf2f8b9011d2a033142585c277440355aa288f0ecf26bd441\""
        id         = "4211302:jeffrey"
        # (3 unchanged attributes hidden)
    }
  # module.github.github_team_repository.payutc_bdecotiz has been changed
  ~ resource "github_team_repository" "payutc_bdecotiz" {
      ~ etag       = "W/\"9509f5fe8cdbb2e2c0cc4115982d7d974c3077d377895845093307c1aef4dffa\"" -> "W/\"04ad1ab377e9f639d72d76ee94fd74704b4e224ba4f5971d216eabc7fe1db424\""
        id         = "3158200:bdecotiz"
        # (3 unchanged attributes hidden)
    }
  # module.github.github_team_repository.portail_utc_mobile has been changed
  ~ resource "github_team_repository" "portail_utc_mobile" {
      ~ etag       = "W/\"9051ce938916392c18da1869c9eb664460a514233c65142060334baf00fbfe3b\"" -> "W/\"c0723c735793cb35b81ad20340c6a23c111ceee120fe1e9cf678e02133538b24\""
        id         = "3158212:utc-mobile"
        # (3 unchanged attributes hidden)
    }
  # module.github.github_team_repository.emploidut_emploidutApi has been changed
  ~ resource "github_team_repository" "emploidut_emploidutApi" {
      ~ etag       = "W/\"9ca07dcfe9845405384c6b83d4284903faa3e4e952689aa0a0746f3c5e920b9e\"" -> "W/\"7fe0e04a5b2688ca1c72e0a60e7b43af0060dd050818d2101e0efbb30e671777\""
        id         = "4586369:emploidut-api"
        # (3 unchanged attributes hidden)
    }
  # module.github.github_team_repository.simde_jeffreyApi has been changed
  ~ resource "github_team_repository" "simde_jeffreyApi" {
      ~ etag       = "W/\"f52ff04bbae762ca02ac52de81ee1d9a496c2226241a99f50fb7990fa1211c17\"" -> "W/\"5ead4f2cc8e75c408ae6d8194c8b0554f7fbcfa1e4ddd9e804d3e77ff901863a\""
        id         = "4217733:jeffrey-api"
        # (3 unchanged attributes hidden)
    }
  # module.github.github_team_repository.application_utcbde_utc_mobile has been changed
  ~ resource "github_team_repository" "application_utcbde_utc_mobile" {
      ~ etag       = "W/\"9051ce938916392c18da1869c9eb664460a514233c65142060334baf00fbfe3b\"" -> "W/\"c0723c735793cb35b81ad20340c6a23c111ceee120fe1e9cf678e02133538b24\""
        id         = "3158184:utc-mobile"
        # (3 unchanged attributes hidden)
    }
  # module.github.github_team.payutc has been changed
  ~ resource "github_team" "payutc" {
      ~ etag          = "W/\"337cf58fa6f556519407e7b12d44b857ed753ad99a64fdeb01d3261987eb5586\"" -> "W/\"7f331cd1a6b7c0a962854dead2a4b09eadd2aacdb38cac53effbb944a6f3915d\""
        id            = "3158200"
        name          = "PayUTC"
        # (5 unchanged attributes hidden)
    }
  # module.github.github_team_repository.payutc_woolly_front has been changed
  ~ resource "github_team_repository" "payutc_woolly_front" {
      ~ etag       = "W/\"94c057596a5af72f885f9ea115f655f08396ab9cc180b12e9d21368e0043d203\"" -> "W/\"e4970cbf59de5508ac50de34aa3f58413862f45e4431e7cb8524c9a595862d79\""
        id         = "3158200:woolly-front"
        # (3 unchanged attributes hidden)
    }
  # module.github.github_team_repository.woolly_woolly_api has been changed
  ~ resource "github_team_repository" "woolly_woolly_api" {
      ~ etag       = "W/\"badeca76d8d71d179f8cceca4d2ce1dffcee8a6f6de96a677b528b6b29fb97de\"" -> "W/\"de885666ffca25ebe6a13c006b7d1f1703b2db9ae887c270ddcd27d47567a0c1\""
        id         = "3158208:woolly-api"
        # (3 unchanged attributes hidden)
    }
  # module.github.github_team_repository.payutc_jessy_api has been changed
  ~ resource "github_team_repository" "payutc_jessy_api" {
      ~ etag       = "W/\"c668ecc93336016177012c1ed9d7c27ed9da9043fd39462decf0ca333a30a4b9\"" -> "W/\"b85917cbef35ccc7f9ab103c342357dce1fd0b044e021401b76349dd15aa252e\""
        id         = "3158200:jessy-api"
        # (3 unchanged attributes hidden)
    }
  # module.github.github_team.planner has been changed
  ~ resource "github_team" "planner" {
      ~ etag          = "W/\"ea11a751ea8f82d35f08eda12e01700ff0f50ac5b375f72e6e397e964501218b\"" -> "W/\"dadd6a018a5f29fae1429ff10fdc0809a9ab41d21da8b8d8d91fe383e06bac96\""
        id            = "3158217"
        name          = "Planner"
        # (5 unchanged attributes hidden)
    }
  # module.github.github_team_repository.jeffrey_jeffreyApi has been changed
  ~ resource "github_team_repository" "jeffrey_jeffreyApi" {
      ~ etag       = "W/\"db718e5cd752928df23c0e09a17feea8d13b0ff1665ef6a140bd07aa0f5ee159\"" -> "W/\"aea0ae5dfe9760f59995c416e36ad63fd08ffc29f9d9524d4b68ed881a922fbc\""
        id         = "4211302:jeffrey-api"
        # (3 unchanged attributes hidden)
    }
  # module.github.github_team.cloud has been changed
  ~ resource "github_team" "cloud" {
      ~ etag          = "W/\"cc339f919a55474e5b7ab10e543203543188410843952c54b1f498c38dae4f85\"" -> "W/\"5c87152adf28ded37fea5df5b73e5f014b2d495f9a63b2faac4d878586c23f58\""
        id            = "3158186"
        name          = "Cloud"
        # (5 unchanged attributes hidden)
    }
  # module.github.github_team.portail has been changed
  ~ resource "github_team" "portail" {
      ~ etag          = "W/\"228fd893936e91172a234c794ea9d1cb2fbd7a841628f16d644725e7e1ba26ad\"" -> "W/\"e23a10ea1b131a969f984a8ab70f4e976954ff266dcf38daa2a5b0de392ad37b\""
        id            = "3158212"
        name          = "Portail"
        # (5 unchanged attributes hidden)
    }
  # module.github.github_team_repository.portail_portail_old has been changed
  ~ resource "github_team_repository" "portail_portail_old" {
      ~ etag       = "W/\"3f439e1e10b44531a774942fcddcd4b94c020d7ed399949001275564dcab12dd\"" -> "W/\"b3cf7c5d805139dc8956d4fb96b93134faea3f3941975e994a479ae562984c36\""
        id         = "3158212:portail-old"
        # (3 unchanged attributes hidden)
    }
  # module.github.github_repository.emploidutemps has been changed
  ~ resource "github_repository" "emploidutemps" {
      ~ etag                   = "W/\"979e6b77025a9700b62f7798b0ed6dfef42b710229c4b353f897fdbd50f8ce22\"" -> "W/\"27f41baacadbd876aeaf0eb0ef4ff9aa4ce0903d834e1fdfb31a7e880d7fe1d5\""
        id                     = "emploidutemps"
        name                   = "emploidutemps"
        # (25 unchanged attributes hidden)
    }
  # module.github.github_team_repository.simde_terraform has been changed
  ~ resource "github_team_repository" "simde_terraform" {
      ~ etag       = "W/\"b848f91d7810c1e2cfcf5eba29570ca8361df8ae3404f9d089a009d53bb50b13\"" -> "W/\"f874628079af4fa9ff86a8ca874285ca84e66540544b3f61c3211be3f2ea2890\""
        id         = "4217733:terraform"
        # (3 unchanged attributes hidden)
    }
  # module.github.github_team_repository.payutc_paymoi has been changed
  ~ resource "github_team_repository" "payutc_paymoi" {
      ~ etag       = "W/\"b9cfbce5f460c168ce9b1f9ec7d4d86e7e726a3802d74f1652f0e57f8d302d5e\"" -> "W/\"6390ea74d348a56beb41fdc12c18d5044ec57dd9f5f7dfa703474a36f03ead2e\""
        id         = "3158200:paymoi"
        # (3 unchanged attributes hidden)
    }
  # module.github.github_team_repository.simde_jeffrey has been changed
  ~ resource "github_team_repository" "simde_jeffrey" {
      ~ etag       = "W/\"d7ad94d63f6107372a14d96e7065509c2329dd5a69af0dd09914faad1a9319d1\"" -> "W/\"71d4a42ef4712cbf17b5949283b0a093c2f1648ded817da72205960cd116b643\""
        id         = "4217733:jeffrey"
        # (3 unchanged attributes hidden)
    }
  # module.github.github_team_repository.payutc_payutc_mobile has been changed
  ~ resource "github_team_repository" "payutc_payutc_mobile" {
      ~ etag       = "W/\"7d8557cfed0175289669e483338a80e0594b7b82015354ed872924ef716c3443\"" -> "W/\"3ed7d5a4f25168105417c570aac47d436585d66e634cd370cae462a3731dfa27\""
        id         = "3158200:payutc-mobile"
        # (3 unchanged attributes hidden)
    }
  # module.github.github_team.locky has been changed
  ~ resource "github_team" "locky" {
      ~ etag          = "W/\"ed865233f284c57b9961ed0f4d19dd99cb254d720f91b3616a0159695755412e\"" -> "W/\"1a7199b6267a0afe6ec4000f66b2b36b8363f76ba3dbb9782899a09453131120\""
        id            = "3644328"
        name          = "Locky"
        # (4 unchanged attributes hidden)
    }
  # module.github.github_team.woolly has been changed
  ~ resource "github_team" "woolly" {
      ~ etag          = "W/\"49ab1c8ee0a0f0fe1996a3db7330e06cd09affe5e273eb145c9c8c5af1875aeb\"" -> "W/\"5d5a0d27b5edf6570ac529db4f9c6aefd786200178aeb8dc25dee41f51970255\""
        id            = "3158208"
        name          = "Woolly"
        # (5 unchanged attributes hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.discord_simde.module.private-admin.discord_category_channel.category will be updated in-place
  ~ resource "discord_category_channel" "category" {
        id        = "778331766016049173"
        name      = "private-admin"
      ~ position  = 11 -> 12
        # (2 unchanged attributes hidden)
    }

  # module.discord_simde.module.private-bde.discord_category_channel.category will be updated in-place
  ~ resource "discord_category_channel" "category" {
        id        = "811739465898000384"
        name      = "private-bde"
      ~ position  = 8 -> 9
        # (2 unchanged attributes hidden)
    }

  # module.discord_simde.module.private-comet.discord_category_channel.category will be updated in-place
  ~ resource "discord_category_channel" "category" {
        id        = "895025366085828659"
        name      = "private-comet"
      ~ position  = 2 -> 3
        # (2 unchanged attributes hidden)
    }

  # module.discord_simde.module.private-emploidut.discord_category_channel.category will be updated in-place
  ~ resource "discord_category_channel" "category" {
        id        = "814062715789508648"
        name      = "private-emploidut"
      ~ position  = 9 -> 10
        # (2 unchanged attributes hidden)
    }

  # module.discord_simde.module.private-gesasso.discord_category_channel.category will be updated in-place
  ~ resource "discord_category_channel" "category" {
        id        = "892367298197876737"
        name      = "private-gesasso"
      ~ position  = 7 -> 8
        # (2 unchanged attributes hidden)
    }

  # module.discord_simde.module.private-integ.discord_category_channel.category will be updated in-place
  ~ resource "discord_category_channel" "category" {
        id        = "802911395418472458"
        name      = "private-integ"
      ~ position  = 4 -> 5
        # (2 unchanged attributes hidden)
    }

  # module.discord_simde.module.private-integfev.discord_category_channel.category will be updated in-place
  ~ resource "discord_category_channel" "category" {
        id        = "897464433268391946"
        name      = "private-integfev"
      ~ position  = 10 -> 11
        # (2 unchanged attributes hidden)
    }

  # module.discord_simde.module.private-jeffrey.discord_category_channel.category will be updated in-place
  ~ resource "discord_category_channel" "category" {
        id        = "782684808395489320"
        name      = "private-jeffrey"
      ~ position  = 5 -> 6
        # (2 unchanged attributes hidden)
    }

  # module.discord_simde.module.private-payutc.discord_category_channel.category will be updated in-place
  ~ resource "discord_category_channel" "category" {
        id        = "778331763218972724"
        name      = "private-payutc"
      ~ position  = 3 -> 4
        # (2 unchanged attributes hidden)
    }

  # module.discord_simde.module.private-treso.discord_category_channel.category will be updated in-place
  ~ resource "discord_category_channel" "category" {
        id        = "778331760605528146"
        name      = "private-flairsou"
      ~ position  = 1 -> 2
        # (2 unchanged attributes hidden)
    }

  # module.discord_simde.module.private-woolly.discord_category_channel.category will be updated in-place
  ~ resource "discord_category_channel" "category" {
        id        = "783640459279990824"
        name      = "private-woolly"
      ~ position  = 6 -> 7
        # (2 unchanged attributes hidden)
    }

  # module.discord_simde.module.public-entraide.discord_category_channel.category will be created
  + resource "discord_category_channel" "category" {
      + id        = (known after apply)
      + name      = "public-entraide"
      + position  = 1
      + server_id = "759778767831957535"
      + type      = "category"
    }

  # module.discord_simde.module.public-entraide.discord_channel_permission.member[0] will be created
  + resource "discord_channel_permission" "member" {
      + allow        = 103924288
      + channel_id   = (known after apply)
      + deny         = 197889
      + id           = (known after apply)
      + overwrite_id = "759778767831957535"
      + type         = "role"
    }

  # module.discord_simde.module.public-entraide.discord_text_channel.text will be created
  + resource "discord_text_channel" "text" {
      + category                 = (known after apply)
      + id                       = (known after apply)
      + name                     = "public-entraide"
      + nsfw                     = false
      + position                 = 0
      + server_id                = "759778767831957535"
      + sync_perms_with_category = true
      + type                     = "text"
    }

  # module.discord_simde.module.public-entraide.discord_voice_channel.voice will be created
  + resource "discord_voice_channel" "voice" {
      + bitrate                  = 64000
      + category                 = (known after apply)
      + id                       = (known after apply)
      + name                     = "public-entraide"
      + position                 = 1
      + server_id                = "759778767831957535"
      + sync_perms_with_category = true
      + type                     = "voice"
    }

  # module.github.module.victor_moreliere.github_membership.membership will be created
  + resource "github_membership" "membership" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + username = "GalliusJulius"
    }

Plan: 5 to add, 11 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @cesar-richard, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform CI`*